elem-prog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-13 Thu 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lehman" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7b242c">1. Elements of Programming by Alexander Stepanov &amp; Paul McJones</a></li>
<li><a href="#org65fab6b">2. Chapter 1: Foundations</a>
<ul>
<li><a href="#orgaa90c0b">2.1. Entity</a>
<ul>
<li><a href="#org1638257">2.1.1. Abstract entity</a></li>
<li><a href="#org5d748bf">2.1.2. Concrete entity</a></li>
</ul>
</li>
<li><a href="#org5b40175">2.2. Species</a>
<ul>
<li><a href="#org300774a">2.2.1. Abstract species</a></li>
<li><a href="#orgc1b908b">2.2.2. Concrete species</a></li>
</ul>
</li>
<li><a href="#orgc3f94e1">2.3. Genus</a>
<ul>
<li><a href="#org20257d5">2.3.1. Abstract genus</a></li>
<li><a href="#org43cf6ad">2.3.2. Concrete genus</a></li>
</ul>
</li>
<li><a href="#org50d08f4">2.4. Data</a></li>
<li><a href="#org8e5f877">2.5. Values</a></li>
<li><a href="#org7cf7231">2.6. Equality</a></li>
<li><a href="#orgb4c3c21">2.7. Representational equality</a></li>
<li><a href="#org5db83cd">2.8. Value type</a></li>
<li><a href="#org308dea6">2.9. Uniquely represented</a>
<ul>
<li><a href="#orge693289">2.9.1. Examples:</a></li>
</ul>
</li>
<li><a href="#org8d110fa">2.10. Lemma 1.1</a></li>
<li><a href="#org5341ce5">2.11. Lemma 1.2</a></li>
</ul>
</li>
<li><a href="#org4c4437d">3. Chapter 2: Transformations and Their Orbits</a></li>
<li><a href="#orgb63f2ff">4. Chapter 3: Associative Operations</a></li>
<li><a href="#orgfa72782">5. Chapter 4: Linear Orderings</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc7b242c" class="outline-2">
<h2 id="orgc7b242c"><span class="section-number-2">1</span> Elements of Programming by Alexander Stepanov &amp; Paul McJones</h2>
<div class="outline-text-2" id="text-1">
<p>
A good book starts by defining the terms it uses. This book begins with precise definitions of 
elementary notions in programming such as <b>value</b> and <b>equality</b>. By not relying on intuition, 
the book proceeds to rigorously define and explore the foundations of generic programming 
(one of the authors was a creator of the C++ Standard Template Library).
</p>

<p>
This book uses a small subset of C++, focusing on templates and generic programming. It is also 
more mathematical than most books about programming.
</p>
</div>
</div>

<div id="outline-container-org65fab6b" class="outline-2">
<h2 id="org65fab6b"><span class="section-number-2">2</span> Chapter 1: Foundations</h2>
<div class="outline-text-2" id="text-2">
<p>
Programming is all about manipulating objects (e.g. 42), those objects have types (e.g. int), 
and those types cluster together into similar concepts (e.g. numbers).
</p>

<p>
The basic undefined notion in the book is a <b>thing</b>.
</p>
</div>
<div id="outline-container-orgaa90c0b" class="outline-3">
<h3 id="orgaa90c0b"><span class="section-number-3">2.1</span> Entity</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org1638257" class="outline-4">
<h4 id="org1638257"><span class="section-number-4">2.1.1</span> Abstract entity</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
An individual thing that is eternal and unchanging. For example, the number 42.
</p>
</div>
</div>
<div id="outline-container-org5d748bf" class="outline-4">
<h4 id="org5d748bf"><span class="section-number-4">2.1.2</span> Concrete entity</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
An individual thing that comes into existence in space and time. For example, 
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">n</span> = <span style="color: #AE81FF;">42</span>;
</pre>
</div>

<p>
The particular concrete entity <code>n</code> will only exist as long as it's in scope in the program, then 
it will eventually be overwritten.
</p>
</div>
</div>
</div>

<div id="outline-container-org5b40175" class="outline-3">
<h3 id="org5b40175"><span class="section-number-3">2.2</span> Species</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org300774a" class="outline-4">
<h4 id="org300774a"><span class="section-number-4">2.2.1</span> Abstract species</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Describes properties of essentially equivalent abstract entities. Types are examples of species.
</p>
</div>
</div>
<div id="outline-container-orgc1b908b" class="outline-4">
<h4 id="orgc1b908b"><span class="section-number-4">2.2.2</span> Concrete species</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Describes properties of essentially equivalent concrete entities. Types are examples of species.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc3f94e1" class="outline-3">
<h3 id="orgc3f94e1"><span class="section-number-3">2.3</span> Genus</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org20257d5" class="outline-4">
<h4 id="org20257d5"><span class="section-number-4">2.3.1</span> Abstract genus</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
A set of abstract species with properties in common. Examples: numbers and vector spaces are each genera (plural of genus)
</p>
</div>
</div>
<div id="outline-container-org43cf6ad" class="outline-4">
<h4 id="org43cf6ad"><span class="section-number-4">2.3.2</span> Concrete genus</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
A set of concrete species with properties in common.
</p>
</div>
</div>
</div>
<div id="outline-container-org50d08f4" class="outline-3">
<h3 id="org50d08f4"><span class="section-number-3">2.4</span> Data</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A <b>datum</b> is a finite string of ~0~s and ~1~s. Data is the plural of datum. A datum corresponding to a particular entity 
is said to <b>represent</b> that entity.
</p>
</div>
</div>
<div id="outline-container-org8e5f877" class="outline-3">
<h3 id="org8e5f877"><span class="section-number-3">2.5</span> Values</h3>
<div class="outline-text-3" id="text-2-5">
<p>
A <b>value</b> is a <b>datum</b> together with it's <b>interpretation</b>.
</p>
</div>
</div>
<div id="outline-container-org7cf7231" class="outline-3">
<h3 id="org7cf7231"><span class="section-number-3">2.6</span> Equality</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Two values are <b>equal</b> if they refer to the same abstract entity. This may sound circular, but it doesn't have to be, it 
reduces equality of values to equality in the mathematical theories those values model. For example, if the `int` 
type models ℤ, the integers, then we can use the definition of equality as equality of integers. Those integers are not 
values in our program, they are abstract entities, so there is no circularity, it just "bottoms out" in the Platonic realm.
</p>
</div>
</div>
<div id="outline-container-orgb4c3c21" class="outline-3">
<h3 id="orgb4c3c21"><span class="section-number-3">2.7</span> Representational equality</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Two values are <b>representationally equal</b> if they have identical strings of bits.
</p>
</div>
</div>
<div id="outline-container-org5db83cd" class="outline-3">
<h3 id="org5db83cd"><span class="section-number-3">2.8</span> Value type</h3>
<div class="outline-text-3" id="text-2-8">
<p>
A <b>value type</b> is a correspondence between a <a href="#org5b40175">species</a> and a set of <a href="#org50d08f4">data</a>.
</p>
</div>
</div>
<div id="outline-container-org308dea6" class="outline-3">
<h3 id="org308dea6"><span class="section-number-3">2.9</span> Uniquely represented</h3>
<div class="outline-text-3" id="text-2-9">
<p>
A <a href="#org5db83cd">value type</a> is <b>uniquely represented</b> if each <a href="#org50d08f4">datum</a> corresponds to <span class="underline">at most 1</span> <a href="#org1638257">abstract entity.</a>
</p>
</div>
<div id="outline-container-orge693289" class="outline-4">
<h4 id="orge693289"><span class="section-number-4">2.9.1</span> Examples:</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
Imagine a value type as 3-bit integers that use the first bit as a sign (positive or negative) and the remaining two bits 
to store the magnitude, then the set of all possible values are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">datum</td>
<td class="org-right">entity</td>
</tr>

<tr>
<td class="org-right">000</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">001</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">010</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">011</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">100</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">110</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-right">111</td>
<td class="org-right">-3</td>
</tr>
</tbody>
</table>

<p>
Notice how `000` and `100` represent 0 and -0, which are the same abstract entity, but different strings of bits, this value 
type is therefore not uniquely represented.
</p>

<p>
Now imagine a <a href="https://en.wikipedia.org/wiki/Two's_complement">twos complement</a> integer type:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">datum</td>
<td class="org-right">entity</td>
</tr>

<tr>
<td class="org-right">000</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">001</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">010</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">011</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">100</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">101</td>
<td class="org-right">-3</td>
</tr>

<tr>
<td class="org-right">110</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-right">111</td>
<td class="org-right">-1</td>
</tr>
</tbody>
</table>

<p>
Observe that none of the entities are the same, so this value type is uniquely represented.
</p>
</div>
</div>
</div>

<div id="outline-container-org8d110fa" class="outline-3">
<h3 id="org8d110fa"><span class="section-number-3">2.10</span> Lemma 1.1</h3>
<div class="outline-text-3" id="text-2-10">
<p>
If a <a href="#org5db83cd">value type</a> is <a href="#org308dea6">uniquely represented</a>, then <a href="#org7cf7231">equality</a> implies <a href="#orgb4c3c21">representational equality</a>
</p>
</div>
</div>

<div id="outline-container-org5341ce5" class="outline-3">
<h3 id="org5341ce5"><span class="section-number-3">2.11</span> Lemma 1.2</h3>
<div class="outline-text-3" id="text-2-11">
<p>
If a <a href="#org5db83cd">value type</a> is <a href="#org308dea6">uniquely represented</a>, then <a href="#org7cf7231">equality</a> implies <a href="#orgb4c3c21">representational equality</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org4c4437d" class="outline-2">
<h2 id="org4c4437d"><span class="section-number-2">3</span> Chapter 2: Transformations and Their Orbits</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-C++" id="org60609fc"><span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">Domain</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">Op</span><span style="color: #AE81FF;">)</span> <span style="color: #66D9EF;">int</span>
<span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">requires</span><span style="color: #AE81FF;">(</span>...<span style="color: #AE81FF;">)</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-C++"><span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">Domain</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">Op</span><span style="color: #AE81FF;">)</span> <span style="color: #66D9EF;">int</span>
<span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">requires</span><span style="color: #AE81FF;">(</span>...<span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">template</span><span style="color: #AE81FF;">&lt;</span><span style="color: #F92672;">typename</span> <span style="color: #66D9EF;">Op</span><span style="color: #AE81FF;">&gt;</span>
    <span style="color: #A6E22E;">requires</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">BinaryOperation</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">Op</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
Domain<span style="color: #AE81FF;">(</span>Op<span style="color: #AE81FF;">)</span> <span style="color: #A6E22E;">square</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Domain</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">Op</span><span style="color: #66D9EF;">)</span>&amp; x, <span style="color: #66D9EF;">Op</span> <span style="color: #FD971F;">op</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">return</span> op<span style="color: #66D9EF;">(</span>x, x<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
   <span style="color: #F92672;">auto</span> <span style="color: #FD971F;">mult</span> = <span style="color: #66D9EF;">[](</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>, <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span> <span style="color: #F92672;">return</span> a * b; <span style="color: #66D9EF;">}</span>;
   <span style="color: #F92672;">typedef</span> <span style="color: #F92672;">decltype</span><span style="color: #66D9EF;">(</span>mult<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">Op</span>;

   cout &lt;&lt; square<span style="color: #66D9EF;">&lt;</span><span style="color: #66D9EF;">Op</span><span style="color: #66D9EF;">&gt;(</span><span style="color: #AE81FF;">2</span>, mult<span style="color: #66D9EF;">)</span> &lt;&lt; endl
        &lt;&lt; square<span style="color: #66D9EF;">&lt;</span><span style="color: #66D9EF;">Op</span><span style="color: #66D9EF;">&gt;(</span><span style="color: #AE81FF;">3</span>, mult<span style="color: #66D9EF;">)</span> &lt;&lt; endl;
   <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">0</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb63f2ff" class="outline-2">
<h2 id="orgb63f2ff"><span class="section-number-2">4</span> Chapter 3: Associative Operations</h2>
</div>
<div id="outline-container-orgfa72782" class="outline-2">
<h2 id="orgfa72782"><span class="section-number-2">5</span> Chapter 4: Linear Orderings</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lehman</p>
<p class="date">Created: 2018-09-13 Thu 22:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
